{
  "orcid": "0009-0004-9300-3936",
  "fetchedAt": "2026-02-19T14:40:33.025179+00:00",
  "profile": {
    "name": "Islam I. Abdulaal",
    "biography": "Islam I. Abdulaal is pursuing a B.Sc. (Hons.) in Electronics and Communications Engineering at Alexandria University, graduating in 2026. Since 2023, he has been a researcher with the OPST Group (CSMNP, SmartCI, Alexandria University), focusing on Fiber Bragg Grating (FBG)-based optical sensing for biomedical monitoring. He contributed to an AUTP-funded proposal (USD 15,000) on Multi-parameter Vital Monitoring via FBG (MVM-FBG).\nIn 2025, he joined the NanoPhoto Lab at A*STAR, Singapore, as a research intern through the Labs Program, Egypt Scholars, working on Physics-Informed Neural Networks (PINNs) for optimizing integrated quantum light source and detection structures. His bachelor thesis investigates silicon photonic devices and on-chip Mode Division Multiplexing (MDM) for intra–data center systems.\nHe has completed over 300 hours of advanced training in ASIC design, PCB/FPGA systems, and AI, and developed multiple DSP and embedded systems projects. Islam has been recognized as a national finalist and global nominee in several competitions, received multiple scholarships, and is an active IEEE Student Member.\nHe previously served as Chair of the IEEE Solid-State Circuits Society (SSCS) Alexandria University Student Branch Chapter and has co-founded early-stage ventures translating lab-scale research into practical technologies.",
    "keywords": [
      "Integrated Photonics",
      "Nanophotonics",
      "Nonlinear Optics"
    ],
    "researcherUrls": [
      {
        "name": "LinkedIn",
        "url": "https://www.linkedin.com/in/iabdul-aal/"
      },
      {
        "name": "Twitter",
        "url": "https://x.com/iabdul_aal"
      }
    ]
  },
  "educations": [
    {
      "degree": "Bachelor of Science in Electronics and Communications Engineering",
      "org": "Alexandria University",
      "period": "2021 - 2026",
      "summary": ""
    }
  ],
  "memberships": [
    {
      "organization": "IEEE",
      "detail": "Member"
    }
  ]
}
